WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
        for (int index = 0; index < strlen(config_value); index++)
        {
            lowercase[index] = tolower(config_value[index]);
        }
        lowercase[strlen(config_value)] = 0;
        if ((strcmp(lowercase, "true") == 0) || (strcmp(lowercase, "yes") == 0) || (config_value[0] == '1'))
        {
            value = 1;
        }
        else
        {
            if ((strcmp(lowercase, "false") == 0) || (strcmp(lowercase, "no") == 0) || (config_value[0] == '0'))
            {
                value = 0;
            }
        }
        kmm_free(lowercase);
    }

    return(value);
}


/****************************************************************************
 * Name: hcom_nx_config_parse_unsigned_integer
 *
 * Description:
 *  Safely convert the number represented as a string into an unsigned integer.
 *  object.
 * 
 * Input Parameters:
 *  number - String to be converted.
 *  default_value - Default value to be used
 *
 * Returned Value:
 *  Number as an unsigned integer if it can be safely converted or the
 *  default_value if there is a problem.
 *
 * Assumptions/Limitations:
 *  None.
 ****************************************************************************/
static uint32_t hcom_nx_config_parse_unsigned_integer(const char *config_value, uint32_t default_value)
{
    uint32_t value = default_value;

    if (config_value != NULL)
    {
        if (strspn(config_value, "0123456789") == strlen(config_value))
        {
            long l = atol(config_value);
            if (l <= UINT32_MAX)
            {
                value = (uint32_t) (l & 0xffffffff);
            }
        }
    }

    return(value);
}

/****************************************************************************
 * Name: hcom_nx_config_is_valid_ip_address
 *
 * Description:
 *  Determine if an IP address is valid or not.
 *
 * Input Parameters:
 *  address - address to be checked.
 *
 * Returned Value:
 *  true if the IP address is valid, false otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static bool hcom_nx_config_is_valid_ip_address(const char *address)
{
    struct sockaddr_in sa;
    return(inet_pton(AF_INET, address, &(sa.sin_addr)) == 1);
}

/****************************************************************************
 * Name: hcom_nx_config_parse_ip_address
 *
 * Description:
 *  Parse the string and determine if it is a valid address and return a
 *  uint32_t value for the IP address.
 *
 * Input Parameters:
 *  address - address to be parsed
 *
 * Returned Value:
 *  uint32_t value representing the IP address or 0 if the address is
 *  invalid.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static uint32_t hcom_nx_config_parse_ip_address(const char *address)
{
    uint32_t ip = 0;
    if (address != NULL)
    {
        struct sockaddr_in sa;
        if (inet_pton(AF_INET, address, &(sa.sin_addr)) == 1)
        {
            ip = (uint32_t ) sa.sin_addr.s_addr;
        }
    }
    return(ip);
}

/****************************************************************************
 * Name: hcom_nx_config_setup_default_ntp_servers
 *
 * Description:
 *  Setup the default NTP servers.
 *
 * Input Parameters:
 *  config - pointer to the configuration object.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_setup_default_ntp_servers(meadow_configuration_t *config)
{
    config->ntp_servers_count = 4;
    config->ntp_servers = kmm_malloc(4 * sizeof(char *));
    config->ntp_servers[0] = kmm_strdup(NTP_DEFAULT_SERVER0);
    config->ntp_servers[1] = kmm_strdup(NTP_DEFAULT_SERVER1);
    config->ntp_servers[2] = kmm_strdup(NTP_DEFAULT_SERVER2);
    config->ntp_servers[3] = kmm_strdup(NTP_DEFAULT_SERVER3);
}

/****************************************************************************
 * Name: hcom_nx_config_create_dns_resolver_file
 *
 * Description:
 *  Create the DNS resolver file populated with the servers (where valid)
 *  specified.
 *
 * Input Parameters:
 *  servers - pointer to a list of DNS server IP addresses.
 *  server_count - number of servers in the list.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static void hcom_nx_config_create_dns_resolver_file(const char **servers, uint32_t server_count)
{
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "wb");
    for (int index = 0; index < server_count; index++)
    {
        if (hcom_nx_config_is_valid_ip_address(servers[index]))
        {
            fputs("nameserver ", dns_file);
            fputs(servers[index], dns_file);
            fputs("\n", dns_file);
        }
    }
    fclose(dns_file);
}

/****************************************************************************
 * Name: hcom_nx_config_setup_default_dns_servers
 *
 * Description:
 *  Create the DNS resolver file with a default DNS server entry.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_config_setup_default_dns_servers(void)
{
    char *servers = DNS_DEFAULT_SERVER;
    hcom_nx_config_create_dns_resolver_file((const char **) &servers, 1);
}

/****************************************************************************
 * Name: hcom_nx_find_interface
 *
 * Description:
 *  Find the specified interface in the list of registered (possible) interfaces.
 *
 * Input Parameters:
 *  interface_type - Type of interface being processed.
 *
 * Returned Value:
 *  Pointer to the interface requested, NULL if the interface cannot be found.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static meadow_network_interface_t *hcom_nx_find_interface(uint32_t interface_type)
{
    meadow_network_interface_t *interface = NULL;
    for (int index = 0; index < sizeof(network_interfaces) / sizeof(meadow_network_interface_t); index++)
    {
        if (network_interfaces[index].interface_type == interface_type)
        {
            interface = &network_interfaces[index];
            break;
        }
    }
    return(interface);
}

/****************************************************************************
 * Name: hcom_nx_process_interface_section
 *
 * Description:
 *  Process a network interface definition from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  yaml_interface - Pointer to information about a network interface.
 *  interface_type - Type of interface being processed.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_process_interface_section(yaml_network_interface_t *yaml_interface, uint32_t interface_type)
{
    if (yaml_interface != NULL)
    {
        meadow_network_interface_t *interface = hcom_nx_find_interface(interface_type);
        if (interface != NULL)
        {
            interface->ip_address = hcom_nx_config_parse_ip_address(yaml_interface->ip_address);
            interface->netmask = hcom_nx_config_parse_ip_address(yaml_interface->netmask);
            interface->gateway = hcom_nx_config_parse_ip_address(yaml_interface->gateway);
            if ((interface->ip_address == 0) || (interface->netmask == 0) || (interface->gateway == 0))
            {
                interface->use_dhcp = 1;
            }
            else
            {
                interface->use_dhcp = 0;
            }
        }
    }
}

/****************************************************************************
 * Name: hcom_nx_process_network_section
 *
 * Description:
 *  Process the network section from the meadow.config.yaml file.
 *
 * Input Parameters:
 *  network_config - Pointer the to yaml_network_t object containing the
 *                   network configuration from the config file.
 *  meadow_configuration - Pointer to the configuration information being
 *                         assembled from the config file.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration structure has been locked by the caller.
 *
 ****************************************************************************/
static void hcom_nx_process_network_section(yaml_network_t *network_config, meadow_configuration_t *config)
{
    if (network_config != NULL)
    {
        config->get_network_time_at_startup = hcom_nx_config_parse_boolean(network_config->get_network_time_at_startup, 0);
        if (network_config->ntp_servers_count > 0)
        {
            config->ntp_servers_count = network_config->ntp_servers_count;
            config->ntp_servers = kmm_malloc(meadow_configuration->ntp_servers_count * sizeof(char *));
            for (int index = 0; index < meadow_configuration->ntp_servers_count; index++)
            {
                config->ntp_servers[index] = kmm_strdup(network_config->ntp_servers[index]);
            }
        }
        else
        {
            hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
        }
        config->ntp_refresh_period_seconds = hcom_nx_config_parse_unsigned_integer(network_config->ntp_refresh_period_seconds, NTP_DEFAULT_REFRESH_PERIOD);
        if (config->ntp_refresh_period_seconds < NTP_MINIMUM_REFRESH_PERIOD)
        {
            config->ntp_refresh_period_seconds = NTP_MINIMUM_REFRESH_PERIOD;
        }
        bool create_default_dns_resolver_file = true;
        if (network_config->dns_servers_count > 0)
        {
            for (int index = 0; index < network_config->dns_servers_count; index++)
            {
                if (hcom_nx_config_is_valid_ip_address(network_config->dns_servers[index]))
                {
                    create_default_dns_resolver_file = false;
                    break;
                }
            }
        }
        if (create_default_dns_resolver_file)
        {
            hcom_nx_config_setup_default_dns_servers();
        }
        else
        {
            hcom_nx_config_create_dns_resolver_file(network_config->dns_servers, network_config->dns_servers_count);
        }
        //
        //  Now work out the network interface / adapter details.
        //
        hcom_nx_process_interface_section(network_config->ethernet, MEADOW_IFT_ETHERNET);
        hcom_nx_process_interface_section(network_config->wifi, MEADOW_IFT_ESP32);
        //
        //  Now work out which adapter should be used.
        //
        bool use_ethernet = false;
        bool use_wifi = false;
        if ((network_config->ethernet != NULL) && (hcom_nx_config_parse_boolean(network_config->ethernet->default_interface, false) == 1))
        {
            use_ethernet = true;
        }
        if ((network_config->wifi != NULL) && (hcom_nx_config_parse_boolean(network_config->wifi->default_interface, false) == 1))
        {
            use_wifi = true;
        }
        if (use_ethernet == use_wifi)
        {
            config->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
        }
        else
        {
            if (use_ethernet)
            {
                config->default_interface = hcom_nx_find_interface(MEADOW_IFT_ETHERNET);
            }
            else
            {
                config->default_interface = hcom_nx_find_interface(MEADOW_IFT_ESP32);
            }
        }
    }
    else
    {
        hcom_nx_config_setup_default_ntp_servers(config);
        hcom_nx_config_setup_default_dns_servers();
        config->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
    }
}

/****************************************************************************
 * Name: hcom_nx_config_read_file
 *
 * Description:
 *  Read the current configuration from flash and populate the configuration
 *  object.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the newly populated configuration object or NULL if there was
 *  a problem.
 *
 * Assumptions/Limitations:
 *  This method is only allowed to be called once to read the configuration
 *  at startup.  Duplicate calls to this method simply return the current
 *  value of the meadow_configuration pointer and take no other action.
 *
 ****************************************************************************/
static meadow_configuration_t *hcom_nx_config_read_file(void)
{
    hcom_nx_config_lock();
    if (meadow_configuration == NULL)
    {
        meadow_configuration = (meadow_configuration_t *) kmm_malloc(sizeof(meadow_configuration_t));
        if (meadow_configuration != NULL)
        {
        	yaml_configuration_t *configuration;

            memset(meadow_configuration, 0, sizeof(meadow_configuration_t));
            cyaml_err_t err = cyaml_load_file(MEADOW_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &configuration_schema, (void **) &configuration, NULL);
            if ((err != CYAML_OK) || (configuration == NULL))
            {
                //
                //  Add any default settings here.
                //
                meadow_configuration->using_default_configuration = 1;
                meadow_configuration->reboot_on_unhandled_exceptions = 1;
                meadow_configuration->sd_card_present = 0;
                meadow_configuration->initialisation_timeout_seconds = DEFAULT_INITIALISATION_TIMEOUT_SECONDS;
                meadow_configuration->reset_esp32_at_startup = 1;
                meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                meadow_configuration->maximum_retry_count = 3;
                hcom_nx_config_setup_default_dns_servers();                
                hcom_nx_config_setup_default_ntp_servers(meadow_configuration);
                meadow_configuration->ntp_refresh_period_seconds = NTP_DEFAULT_REFRESH_PERIOD;
                meadow_configuration->default_interface = &network_interfaces[MEADOW_DEFAULT_NETWORK_INTERFACE];
            }
            else
            {
                meadow_configuration->using_default_configuration = 0;
                if (configuration->mono_control != NULL)
                {
                    meadow_configuration->mono_options = kmm_strdup(configuration->mono_control->options);
                }
                //
                if (configuration->coprocessor != NULL)
                {
                    uint32_t speed = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->spi_speed_hz, DEFAULT_STM_ESP_SPI_SPEED);
                    meadow_configuration->esp_spi_speed_hz = (speed < 100000) ? 100000 : speed;
                    meadow_configuration->automatically_reconnect = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_reconnect, false);
                    meadow_configuration->automatically_start_network = hcom_nx_config_parse_boolean(configuration->coprocessor->automatically_start_network, false);
                    meadow_configuration->maximum_retry_count = hcom_nx_config_parse_unsigned_integer(configuration->coprocessor->maximum_retry_count, 3);
                }
                else
                {
                    meadow_configuration->reset_esp32_at_startup = 1;
                    meadow_configuration->esp_spi_speed_hz = DEFAULT_STM_ESP_SPI_SPEED;
                }
                hcom_nx_process_network_section(configuration->network, meadow_configuration);
                if (configuration->internal_debug != NULL)
                {
                    meadow_configuration->trace_level = hcom_nx_config_parse_unsigned_integer(configuration->internal_debug->trace_level, 0);
                    if (meadow_configuration->trace_level > 4)
                    {
                        meadow_configuration->trace_level = 0;
                    }
                    meadow_configuration->use_uart1_for_trace = (strcmp(configuration->internal_debug->uart1_use, "trace") == 0);
                    meadow_configuration->reset_esp32_at_startup = !hcom_nx_config_parse_boolean(configuration->internal_debug->debugger_attached_to_esp, false);
                }
                //
                if (configuration->device != NULL)
                {
                    if (configuration->device->name != NULL)
                    {
                        meadow_configuration->device_name = kmm_strdup(configuration->device->name);
                    }
                    else
                    {
                        meadow_configuration->device_name = kmm_strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
                    }
                    meadow_configuration->reboot_on_unhandled_exceptions = hcom_nx_config_parse_boolean(configuration->device->reboot_on_unhandled_exceptions, true);
                    meadow_configuration->initialisation_timeout_seconds = hcom_nx_config_parse_unsigned_integer(configuration->device->initialisation_timeout_seconds, DEFAULT_INITIALISATION_TIMEOUT_SECONDS);
                    meadow_configuration->sd_card_present = hcom_nx_config_parse_boolean(configuration->device->sd_card_present, false);
                }
                //
                meadow_configuration->esp_software_version = NULL;

                cyaml_free(&cyaml_config, &configuration_schema, configuration, 0);
            }
        }
    }
    hcom_nx_config_unlock();

#if defined(USE_MEADOW_DEBUG_HELPERS)
    MEADOW_TRACE_INFORMATION("Using %s configuration\n", (meadow_configuration->using_default_configuration == 1) ? "default" : "user");
    MEADOW_TRACE_INFORMATION("Device Information:\n");
    MEADOW_TRACE_INFORMATION("    Device name: %s\n", meadow_configuration->device_name);
    MEADOW_TRACE_INFORMATION("    Reboot on unhandled exception: %d\n", meadow_configuration->reboot_on_unhandled_exceptions);
    MEADOW_TRACE_INFORMATION("    Initialisation timeout: %d seconds\n", meadow_configuration->initialisation_timeout_seconds);
    MEADOW_TRACE_INFORMATION("    SD card present: %d\n", meadow_configuration->sd_card_present);
    MEADOW_TRACE_INFORMATION("Mono Control:\n");
    MEADOW_TRACE_INFORMATION("    Options: %s\n", (meadow_configuration->mono_options == NULL) ? "None configured" : meadow_configuration->mono_options);
    MEADOW_TRACE_INFORMATION("Coprocessor:\n");
    MEADOW_TRACE_INFORMATION("    SPI speed: %d Hz\n", meadow_configuration->esp_spi_speed_hz);
    MEADOW_TRACE_INFORMATION("    Automatically start network: %d\n", meadow_configuration->automatically_start_network);
    MEADOW_TRACE_INFORMATION("    Automatically reconnect: %d\n", meadow_configuration->automatically_reconnect);
    MEADOW_TRACE_INFORMATION("    Maximum retry count: %d\n", meadow_configuration->maximum_retry_count);
    char address[INET_ADDRSTRLEN];
    MEADOW_TRACE_INFORMATION("Network:\n");
    MEADOW_TRACE_INFORMATION("    Ethernet:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    WiFi:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    Get network time at startup: %d\n", meadow_configuration->get_network_time_at_startup);
    MEADOW_TRACE_INFORMATION("    NTP refresh period: %d seconds\n", meadow_configuration->ntp_refresh_period_seconds);
    MEADOW_TRACE_INFORMATION("    NTP Servers (%d):\n", meadow_configuration->ntp_servers_count);
    int index = 0;
    for (index = 0; index < meadow_configuration->ntp_servers_count; index++)
    {
        inet_ntop(AF_INET, &meadow_configuration->ntp_servers[index], address, INET_ADDRSTRLEN);
        MEADOW_TRACE_INFORMATION("        - %s\n", address);
    }
    MEADOW_TRACE_INFORMATION("    DNS Servers:\n");
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "rb");
    char buffer[32];
    while (fgets(buffer, 32, dns_file) != NULL)
    {
        MEADOW_TRACE_INFORMATION("        - %s", (buffer + 11));
    }
    fclose(dns_file);
    MEADOW_TRACE_INFORMATION("Internal Debug:\n");
    MEADOW_TRACE_INFORMATION("    Use UART for trace: %d\n", meadow_configuration->use_uart1_for_trace);
    MEADOW_TRACE_INFORMATION("    Trace level: %d\n", meadow_configuration->trace_level);
    MEADOW_TRACE_INFORMATION("    Debugger attached to ESP32: %d\n", (meadow_configuration->reset_esp32_at_startup == 1) ? 0 : 1);
#endif

    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_config_copy_string
 *
 * Description:
 *  Copy a string into the buffer and return the amount of storage used to
 *  store the string and its terminating 0.
 *
 * Input Parameters:
 *  source - String to be copied.
 *  destination - Memory to hold the copy of the string.
 *
 * Returned Value:
 *  Amount of memory consumed by the string and its terminating 0.
 *
 * Assumptions/Limitations:
 *  The destination buffer is large enough to hold tha copy of the string.
 *
 ****************************************************************************/
int hcom_nx_config_copy_string(char *source, char *destination)
{
    int length = 0;

    if (source == NULL)
    {
        *destination = 0;
    }
    else
    {
        length = strlen(source);
        strcpy(destination, source);
    }

