WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if (buffer_length > 16)
    {
        result = snprintf((char *) buffer, buffer_length, "%d.%d.%d.%d", (config->mono_version >> 24) & 0xff, (config->mono_version >> 16) & 0xff,
                            (config->mono_version >> 8) & 0xff, config->mono_version & 0xff);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_maximum_retry_count
 *
 * Description:
 *  Set the MaximumRetryCount property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the MaximumRetryCount
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_maximum_retry_count(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 4)
    {
        int retryCount = *((int *) buffer);
        result = hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, retryCount);
        if (result == OK)
        {
            config->maximum_retry_count = retryCount;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_automatically_reconnect
 *
 * Description:
 *  Set the AutomaticallyReconnect property and inform the ESP of the change.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_automatically_reconnect(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, *buffer);
        if (result == OK)
        {
            config->automatically_reconnect = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_set_config_value
 *
 * Description:
 *  Read or write a configuration value.
 *
 * Input Parameters:
 *  item - Value to be accessed.
 *  direction - Read (0) or write (1).
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_set_config_value(int item, uint8_t direction, uint8_t *buffer, int buffer_length)
{
    int result;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    if (direction == 0)
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_get_string_value(config->device_name, buffer, buffer_length);
                break;
            case cv_product:
                result = hcom_nx_config_get_uint32_value(config->hardware_version, buffer, buffer_length);
                break;
            case cv_model:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_MODEL, buffer, buffer_length);
                break;
            case cv_os_version:
                result = hcom_nx_config_get_string_value(config->meadow_software_version, buffer, buffer_length);
                break;
            case cv_build_date:
                result = hcom_nx_config_get_string_value(__DATE__ " " __TIME__, buffer, buffer_length);
                break;
            case cv_processor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_PROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_unique_id:
                result = hcom_nx_config_get_unique_id(config, buffer, buffer_length);
                break;
            case cv_serial_number:
                result = hcom_nx_config_get_serial_number(config, buffer, buffer_length);
                break;
            case cv_coprocessor_type:
                result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_COPROCESSOR_TYPE, buffer, buffer_length);
                break;
            case cv_coprocessor_firmware_version:
                result = hcom_nx_config_get_coprocessor_firmware_version(config, buffer, buffer_length);
                break;
            case cv_mono_version:
                result = hcom_nx_config_get_mono_version(config, buffer, buffer_length);
                break;
            case cv_automatically_start_network:
                result = hcom_nx_config_get_uint8_value(config->automatically_start_network, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_get_uint8_value(config->automatically_reconnect, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_get_uint32_value(config->maximum_retry_count, buffer, buffer_length);
                break;
            case cv_get_time_at_startup:
                result = hcom_nx_config_get_uint8_value(config->get_network_time_at_startup, buffer, buffer_length);
                break;
            case cv_mac_address:
                result = hcom_nx_config_get_bytes(config->board_mac_address, sizeof(config->board_mac_address), buffer, buffer_length);
                break;
            case cv_soft_ap_mac_address:
                result = hcom_nx_config_get_bytes(config->soft_ap_mac_address, sizeof(config->soft_ap_mac_address), buffer, buffer_length);
                break;
            case cv_default_access_point:
                result = hcom_nx_config_get_string_value(config->default_access_point, buffer, buffer_length);
                break;
            case cv_reset_reason:
                result = hcom_nx_config_get_bytes(&config->esp32_reset_reason, 1, buffer, buffer_length);
                break;
            case cv_reboot_on_unhandled_exception:
                result = hcom_nx_config_get_uint8_value(config->reboot_on_unhandled_exceptions, buffer, buffer_length);
                break;
            case cv_initialisation_timeout:
                result = hcom_nx_config_get_uint32_value(config->initialisation_timeout_seconds, buffer, buffer_length);
                break;
            case cv_sd_card_present:
                result = hcom_nx_config_get_uint8_value(config->sd_card_present, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    else
    {
        switch (item)
        {
            case cv_device_name:
                result = hcom_nx_config_set_device_name(config, buffer, buffer_length);
                break;
            case cv_automatically_reconnect:
                result = hcom_nx_config_set_automatically_reconnect(config, buffer, buffer_length);
                break;
            case cv_maximum_network_retry_count:
                result = hcom_nx_config_set_maximum_retry_count(config, buffer, buffer_length);
                break;
            default:
                result = ERROR;
                break;
        }
    }
    hcom_nx_config_unlock();
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_process_esp_configuration
 *
 * Description:
 *  Compare the incoming ESP configuration with the current configuration
 *  read from the configuration file.  The configuration file is considered
 *  to be the source of truth.
 *
 *  Send any differences over to the ESP32.
 *
 * Input Parameters:
 *  esp_config - Configuration stored in the ESP32.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_esp_configuration(espcp_system_configuration_t *esp_config)
{
    hcom_nx_config_lock();
    meadow_configuration_t *configuration = hcom_nx_config_get_pointer();
    if (configuration != NULL)
    {
        hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_start_network, configuration->automatically_start_network == 1);
        hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, configuration->automatically_reconnect == 1);
        //
        if (configuration->maximum_retry_count != esp_config->maximum_retry_count)
        {
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, configuration->maximum_retry_count);
        }
        //
        if ((esp_config->device_name != NULL) && (strcmp(configuration->device_name, esp_config->device_name) != 0))
        {
            hcom_nx_config_set_esp_string_value(espcp_configuration_items_device_name, configuration->device_name);
        }
        //
        if (esp_config->default_access_point != NULL)
        {
            configuration->default_access_point = kmm_strdup(esp_config->default_access_point);
        }
        else
        {
            configuration->default_access_point = NULL;
        }
        //
        if (esp_config->software_version != NULL)
        {
            if (configuration->esp_software_version != NULL)
            {
                kmm_free(configuration->esp_software_version);
            }
            configuration->esp_software_version = kmm_strdup(esp_config->software_version);
        }
        else
        {
            configuration->esp_software_version = NULL;
        }
        //
        memcpy(configuration->board_mac_address, esp_config->board_mac_address, 6);
        memcpy(configuration->soft_ap_mac_address, esp_config->soft_ap_mac_address, 6);
        configuration->esp32_reset_reason = esp_config->reset_reason;
    }
    hcom_nx_config_unlock();
}

/****************************************************************************
 * Name: hcom_nx_config_process_wifi_credentials_file
 *
 * Description:
 *  Check to see if a wifi.yaml file exists and send the credentials to the
 *  ESP32 if it exists and contains valid data.
 *
 *  The wifi.yaml file will be deleted as a security measure to prevent
 *  the credentials from being downloaded using the CLI tool.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_wifi_credentials_file(void)
{
    yaml_wifi_credentials_t *credentials;

    cyaml_err_t err = cyaml_load_file(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME, &cyaml_config, &wifi_credentials_schema, (void **) &credentials, NULL);
    if ((err == CYAML_OK) && (credentials != NULL))
    {
        if ((credentials->credentials->ssid != NULL) && (strlen(credentials->credentials->ssid) <= MAXIMUM_SSID_LENGTH) & (strlen(credentials->credentials->ssid) > 0))
        {
            char password[MAXIMUM_PASSWORD_LENGTH + 1];
            memset(password, 0, MAXIMUM_PASSWORD_LENGTH + 1);
            if ((credentials->credentials->password != NULL) && (strlen(credentials->credentials->password) <= MAXIMUM_PASSWORD_LENGTH))
            {
                strcpy(password, credentials->credentials->password);
            }
            uint32_t size = strlen(credentials->credentials->ssid) + strlen(password) + 2;
            uint8_t *buffer = kmm_malloc(size);
            if (buffer != NULL)
            {
                hcom_nx_config_lock();
                meadow_configuration_t *config = hcom_nx_config_get_pointer();
                if (config->default_access_point != NULL)
                {
                    kmm_free(config->default_access_point);
                }
                config->default_access_point = kmm_strdup(credentials->credentials->ssid);
                hcom_nx_config_unlock();
                strcpy((char *) buffer, credentials->credentials->ssid);
                strcpy((char *) (buffer + strlen(credentials->credentials->ssid) + 1), password);
                hcom_nx_config_set_esp_value(espcp_configuration_items_default_ap_and_password, buffer, size);
                kmm_free(buffer);
            }
        }
        cyaml_free(&cyaml_config, &wifi_credentials_schema, credentials, 0);
    }
    //
    //  Now we can delete the file.
    //
    FILE *file = fopen(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME, "r");
    if (file)
    {
        fclose(file);
        unlink(MEADOW_WIFI_CREDENTIALS_DEFAULT_FILE_NAME);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_refresh_mono_version
 *
 * Description:
 *  Refresh the mono version in the specified configuration object.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration object must be locked before this method is called.
 *
 ****************************************************************************/
// void hcom_nx_config_refresh_mono_version(meadow_configuration_t *config)
// {
//     uint32_t mono_version = 0;

//     boardctl(BIOC_ENTER_MEMMAP, 0);

//     // Check if Meadow.OS runtime is flashed at external flash.
//     #define STM32_FMCBANK4_BASE  0x90000000     /* 0x90000000-0x9fffffff: FMC bank 4 */
//     uint32_t signature = *((uint32_t *) STM32_FMCBANK4_BASE);
//     if (signature != 0xDDCCBBAA)
//     {
//         syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
//     }
//     else
//     {
//         mono_version = *((uint32_t *) (STM32_FMCBANK4_BASE + 4));
//     }
//     boardctl(BIOC_EXIT_MEMMAP, 0);

//     config->mono_version = mono_version;
// }

/****************************************************************************
 * Name: hcom_nx_config_validate_and_copy_mono_runtime
 *
 * Description:
 *  Check the mono runtime signature and if it is OK then copy the runtime
 *  into RAM so that it is ready for use.
 * 
 *  The mono_is_valid flag will be set in the config to indicate we can
 *  start Mono if we want to.
 *
 * Input Parameters:
 *  config - Pointer to the current configuration
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_validate_mono_runtime(meadow_configuration_t *config)
{
    config->mono_is_valid = 0;          // Assume we will fail.

    uint32_t block_size = hcom_nx_exec_ex_flash_get_block_size();
    void *buffer = kmm_malloc(block_size);
    if (buffer != NULL)
    {
        hcom_nx_exec_ex_flash_read_absolute_block(0, buffer);
        uint32_t signature = *((uint32_t *) buffer);
        if (signature != 0xDDCCBBAA)
        {
            config->mono_is_valid = 0;
            config->mono_version = 0;
            syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
        }
        else
        {
            config->mono_is_valid = 1;
            config->mono_version = *((uint32_t *) (buffer + 4));
        }
        kmm_free(buffer);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 * 
 *  Note that one of the side effects of this method is to copy the Mono
 *  runtime into RAM making it ready for use (assuming the runtime file is 
 *  validated OK).
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    if (meadow_configuration == NULL)
    {
        sem_init(&config_lock, 0, 1);                   // Create the config lock.
        sem_setprotocol(&config_lock, SEM_PRIO_NONE);
        hcom_nx_config_read_file();

        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_config_get_pointer();
        hcom_nx_config_set_host_name(config, config->device_name);
        config->hardware_version = meadow_hw_version_get();
        hcom_nx_config_validate_mono_runtime(config);
        config->meadow_software_version = HCOM_DEVICE_INFO_MEADOW_OS_VERSION;
        config->meadow_hardware_version = meadow_hw_version_string_return();

        stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
        config->chip_id[0] = config->serial_number[11];                      // 95-88
        config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
        config->chip_id[2] = config->serial_number[9];                       // 79-72
        config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
        config->chip_id[4] = config->serial_number[7];                       // 63-56
        config->chip_id[5] = config->serial_number[6];                       // 55-48

        hcom_nx_config_unlock();
    }
    else
    {
        syslog(LOG_ERR, "Configuration should only be initialised once.\n");
    }
}
